app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`location`, `created_at`, `updated_at`, `units`, `post_id`, `user_id`, `description`, `state`) VALUES('Issaquah Highlands', '2009-07-16 01:51:26', '2009-07-16 01:51:26', 2, NULL, NULL, 'Need ride to SEA airport from ISS', NULL)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `updated_at` = '2009-07-18 03:37:30', `description` = 'Need help with grocery shopping' WHERE `id` = 3