app/controllers/users_controller.rb

  def welcome
    @user = session[:user]
    @posts = Post.find(:all, :limit => 5, :conditions => ["user_id = ?", session[:user][:id]], :order => "created_at")
---
SELECT * FROM `posts` WHERE (user_id = 1) ORDER BY created_at LIMIT 5

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`, `locality`, `password`, `email`) VALUES('Selvam Velmurugan', '2009-07-16 01:08:09', '2009-07-16 01:08:09', 'Issaquah', 'sai', 's_velmurugan@yahoo.com')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
UPDATE `users` SET `updated_at` = '2009-07-16 01:16:51', `name` = 'Lakshmi Nidamarthi' WHERE `id` = 2